driver-tests/bpelse/SchemaElemDecl/BPwithMsgElemCompApp/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:someNS="http://xml.netbeans.org/schema/BPwithMsgElemSchema">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <someNS:MsgElem xmlns:someNS="http://xml.netbeans.org/schema/BPwithMsgElemSchema">
    <msgId>101</msgId>
    <msgStr>Added in the BPEL BPwithMsgElem NonQualified</msgStr>
  </someNS:MsgElem>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
