driver-tests/bpelse/SchemaElemDecl/BPwithMsgElementCompApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpw="http://xml.netbeans.org/schema/BPwithMsgElemSchema">
  <soapenv:Body>
    <bpw:MsgElem>
      <msgId>101</msgId>
      <msgStr>Sending Msg</msgStr>
    </bpw:MsgElem>
  </soapenv:Body>
</soapenv:Envelope>